Reports/РейтингЗачисленийПоГруппам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>РейтингЗачисленийПоГруппам</Name>
			<Comment>Рейтинг зачислений по группам</Comment>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ЗачисленияИВыпуск.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ЗачисленияИВыпуск</Name>
			<Comment>Зачисления и выпуск</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФактПрисутствия</Name>
					<Comment>Факт присутствия</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Воспитанник</Name>
					<Comment>Воспитанник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Дети</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Comment>Группа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/РейтингЗачисленийПоГруппам/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомандаСформироватьОтчет(Команда)
	Отчет();
КонецПроцедуры   

&НаСервере
Процедура Отчет()
 ТабДок=ТабличныйДокумент;
 ТабДок.Очистить();
 ТабДок.ТолькоПросмотр=Истина;
 
 Макет=ПолучитьМакетНаСервере("Макет");
 
 ОбластьЗаголовок=Макет.ПолучитьОбласть("ОбластьЗаголовок");
 ТабДок.Вывести(ОбластьЗаголовок);
 
 ОбластьШапка=Макет.ПолучитьОбласть("ОбластьШапка");
 ТабДок.Вывести(ОбластьШапка);
 
 ОбластьГруппа=Макет.ПолучитьОбласть("ОбластьГруппа");
 ОбластьПериод=Макет.ПолучитьОбласть("ОбластьПериод");
 ОбластьДанные=Макет.ПолучитьОбласть("ОбластьДанные");
 
 ЗапросДанных=Новый Запрос;
 ЗапросДанных.Текст= 
 
 "ВЫБРАТЬ
 |	ЗачисленияИВыпускОстаткиИОбороты.Воспитанник КАК Воспитанник,
 |	ЗачисленияИВыпускОстаткиИОбороты.Группа КАК Группа,
 |	ЗачисленияИВыпускОстаткиИОбороты.Дата КАК Период
 |ИЗ
 |	РегистрНакопления.ЗачисленияИВыпуск.ОстаткиИОбороты КАК ЗачисленияИВыпускОстаткиИОбороты
 |
 |УПОРЯДОЧИТЬ ПО
 |	Воспитанник,
 |	Группа,
 |	Период
 |ИТОГИ ПО
 |	Воспитанник,
 |	Группа,
 |	Период";
  
 ВыборкаГруппа=ЗапросДанных.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Группа");
 
 ТабДок.НачатьАвтогруппировкуСтрок();
 
 Пока  ВыборкаГруппа.Следующий()Цикл
	 ОбластьГруппа.Параметры.Группа=ВыборкаГруппа.Группа;
	 ТабДок.Вывести(ОбластьГруппа, ВыборкаГруппа.Уровень(),,Ложь);
	 
	 ВыборкаПериод=ВыборкаГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период");
	 Пока ВыборкаПериод.Следующий() Цикл
		 ОбластьПериод.Параметры.Период=ВыборкаПериод.Период;
		 ТабДок.Вывести(ОбластьПериод, ВыборкаПериод.Уровень(),,Ложь);
		 
	     ВыборкаДанных=ВыборкаПериод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Воспитанник");
		 Пока ВыборкаДанных.Следующий()Цикл
			 ОбластьДанные.Параметры.Период=ВыборкаДанных.Период;
			 ОбластьДанные.Параметры.Воспитанник=ВыборкаДанных.Воспитанник;
			 ТабДок.Вывести(ОбластьДанные, ВыборкаДанных.Уровень(),,Ложь);
		 КонецЦикла;
	 КонецЦикла;
 КонецЦикла;
 ТабДок.ЗакончитьАвтогруппировкуСтрок();
  
 ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
 ТабДок.МасштабПечати=100;
 
 ТабДок.РазмерСтраницы="A4";
 ТабДок.ТочностьПечати=ТочностьПечати.Точная;
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНаСервере (ИмяМакета)
	
	ЭО=РеквизитФормыВЗначение("Отчет");
	Макет=ЭО.ПолучитьМакет(ИмяМакета);
	Возврат Макет;
	
КонецФункции
